linux/git/git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-05 Thu 10:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="lin chuan" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaf818b5">1. 本地初始化</a></li>
<li><a href="#orgc9f419f">2. 初始化配置</a></li>
<li><a href="#orgfa8c3f7">3. reset, checkout 和 revert</a>
<ul>
<li><a href="#orgad97583">3.1. 回退已经add的文件</a></li>
<li><a href="#org2a63fad">3.2. 参考</a></li>
</ul>
</li>
<li><a href="#orgf384c4c">4. python flake8  pre-commit hook</a></li>
<li><a href="#orgcb88dec">5. 分支管理</a>
<ul>
<li><a href="#org4e164a3">5.1. 获取远程分支</a></li>
<li><a href="#orgb2c70ff">5.2. 创建新分支</a></li>
<li><a href="#orgc01d886">5.3. 删除分支</a>
<ul>
<li><a href="#orgd52f89e">5.3.1. 删除本地分支</a></li>
<li><a href="#org412282b">5.3.2. 删除远端分支</a></li>
</ul>
</li>
<li><a href="#org80bb2ce">5.4. 查看分支</a>
<ul>
<li><a href="#orgd207381">5.4.1. 查看所有branch分支</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge311dc2">6. submodule</a>
<ul>
<li><a href="#org58dd692">6.1. 参考</a></li>
</ul>
</li>
<li><a href="#org2ab44c0">7. 修改commit msg</a></li>
<li><a href="#orgd19a11e">8. merge</a>
<ul>
<li><a href="#orgdf39acc">8.1. 不自动merge</a></li>
<li><a href="#org5c513cf">8.2. merge特定commit **</a></li>
</ul>
</li>
<li><a href="#org5f44870">9. tag</a>
<ul>
<li><a href="#org187e5f2">9.1. delete tags</a>
<ul>
<li><a href="#org70138ef">9.1.1. delete remote tags</a></li>
<li><a href="#orga503cd9">9.1.2. delete local tags</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgaf818b5" class="outline-2">
<h2 id="orgaf818b5"><span class="section-number-2">1</span> 本地初始化</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
git init
git add .
git commit -m "init git"
git remote add origin git@github.com:linchuan1982/web.git
git push -u origin master
</pre>
</div>
</div>

<div id="outline-container-orgc9f419f" class="outline-2">
<h2 id="orgc9f419f"><span class="section-number-2">2</span> 初始化配置</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
git config user.name linchuan1982   
git config user.email linchuan@hunch.ai  
</pre>
</div>
</div>

<div id="outline-container-orgfa8c3f7" class="outline-2">
<h2 id="orgfa8c3f7"><span class="section-number-2">3</span> reset, checkout 和 revert</h2>
<div class="outline-text-2" id="text-3">
<!-- This HTML table template is generated by emacs 26.3 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;命令&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;作用域&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;常用情景&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;git&nbsp;reset&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;提交层面&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;在私有分支上舍弃一些没有提交的更改&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;git&nbsp;reset&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;文件层面&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;将文件从缓存区中移除&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;git&nbsp;checkout&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;提交层面&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;切换分支或查看旧版本&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;git&nbsp;checkout&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;文件层面&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;舍弃工作目录中的更改&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;git&nbsp;revert&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;提交层面&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;在公共分支上回滚更改&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;git&nbsp;revert&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;文件层面&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;（然而并没有）&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>
</div>

<div id="outline-container-orgad97583" class="outline-3">
<h3 id="orgad97583"><span class="section-number-3">3.1</span> 回退已经add的文件</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
git reset HEAD 指定文件
git reset HEAD aivideo/social/migrations/0001_initial.py
</pre>
</div>
</div>

<div id="outline-container-org2a63fad" class="outline-3">
<h3 id="org2a63fad"><span class="section-number-3">3.2</span> 参考</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<a href="https://gitbook.tw/chapters/using-git/reset-commit.html">reset commit</a>
</p>

<p>
<a href="https://github.com/geeeeeeeeek/git-recipes/wiki/5.2-%E4%BB%A3%E7%A0%81%E5%9B%9E%E6%BB%9A%EF%BC%9AReset%E3%80%81Checkout%E3%80%81Revert-%E7%9A%84%E9%80%89%E6%8B%A9">reset-checkout-revert</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgf384c4c" class="outline-2">
<h2 id="orgf384c4c"><span class="section-number-2">4</span> python flake8  pre-commit hook</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
$ flake8 --install-hook git
$ git config --bool flake8.strict true
</pre>
</div>
</div>

<div id="outline-container-orgcb88dec" class="outline-2">
<h2 id="orgcb88dec"><span class="section-number-2">5</span> 分支管理</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org4e164a3" class="outline-3">
<h3 id="org4e164a3"><span class="section-number-3">5.1</span> 获取远程分支</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><p>
checkout方式
</p>
<pre class="example">
git checkout origin/remoteName -b localName
</pre>
<p>
获取远程分支remoteName 到本地新分支localName，并跳到localName分支
</p></li>
<li><p>
fetch方式
</p>

<pre class="example">
git fetch origin branchname:branchname
</pre>

<p>
可以把远程某各分支拉去到本地的branchname下，如果没有branchname，则会在本地新建branchname
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgb2c70ff" class="outline-3">
<h3 id="orgb2c70ff"><span class="section-number-3">5.2</span> 创建新分支</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li><p>
创建本地分支
</p>

<pre class="example">
$ git checkout -b localName
</pre></li>

<li><p>
创建远程分支
</p>

<pre class="example">
git push origin loaclName:remoteName
</pre>

<p>
<b>注意</b> <code>:</code> 左右不能有空格
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgc01d886" class="outline-3">
<h3 id="orgc01d886"><span class="section-number-3">5.3</span> 删除分支</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-orgd52f89e" class="outline-4">
<h4 id="orgd52f89e"><span class="section-number-4">5.3.1</span> 删除本地分支</h4>
<div class="outline-text-4" id="text-5-3-1">
<pre class="example">
git branch -D branch_name
</pre>
</div>
</div>

<div id="outline-container-org412282b" class="outline-4">
<h4 id="org412282b"><span class="section-number-4">5.3.2</span> 删除远端分支</h4>
<div class="outline-text-4" id="text-5-3-2">
<pre class="example">
git push --delete origin branch_name
</pre>
</div>
</div>
</div>

<div id="outline-container-org80bb2ce" class="outline-3">
<h3 id="org80bb2ce"><span class="section-number-3">5.4</span> 查看分支</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-orgd207381" class="outline-4">
<h4 id="orgd207381"><span class="section-number-4">5.4.1</span> 查看所有branch分支</h4>
<div class="outline-text-4" id="text-5-4-1">
<pre class="example">
git branch -a
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge311dc2" class="outline-2">
<h2 id="orge311dc2"><span class="section-number-2">6</span> submodule</h2>
<div class="outline-text-2" id="text-6">
<p>
要在git根目录执行，比如说aishipin
</p>

<pre class="example">
git submodule init
git submodule update
git submodule deinit --all
</pre>
</div>

<div id="outline-container-org58dd692" class="outline-3">
<h3 id="org58dd692"><span class="section-number-3">6.1</span> 参考</h3>
<div class="outline-text-3" id="text-6-1">
<p>
<a href="https://git-scm.com/book/zh/v2/Git-%E5%B7%A5%E5%85%B7-%E5%AD%90%E6%A8%A1%E5%9D%97">官方文档</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org2ab44c0" class="outline-2">
<h2 id="org2ab44c0"><span class="section-number-2">7</span> 修改commit msg</h2>
<div class="outline-text-2" id="text-7">
<pre class="example">
git commit --amend  
</pre>
</div>
</div>

<div id="outline-container-orgd19a11e" class="outline-2">
<h2 id="orgd19a11e"><span class="section-number-2">8</span> merge</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgdf39acc" class="outline-3">
<h3 id="orgdf39acc"><span class="section-number-3">8.1</span> 不自动merge</h3>
<div class="outline-text-3" id="text-8-1">
<pre class="example">
git merge --no-commit --no-ff master
git merge feature/login
</pre>
</div>
</div>

<div id="outline-container-org5c513cf" class="outline-3">
<h3 id="org5c513cf"><span class="section-number-3">8.2</span> merge特定commit **</h3>
<div class="outline-text-3" id="text-8-2">
<pre class="example">
git cherry-pick 62ecb3
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f44870" class="outline-2">
<h2 id="org5f44870"><span class="section-number-2">9</span> tag</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org187e5f2" class="outline-3">
<h3 id="org187e5f2"><span class="section-number-3">9.1</span> delete tags</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org70138ef" class="outline-4">
<h4 id="org70138ef"><span class="section-number-4">9.1.1</span> delete remote tags</h4>
<div class="outline-text-4" id="text-9-1-1">
<pre class="example">
git tag | grep -v "^3" |xargs git push --delete origin
</pre>
</div>
</div>

<div id="outline-container-orga503cd9" class="outline-4">
<h4 id="orga503cd9"><span class="section-number-4">9.1.2</span> delete local tags</h4>
<div class="outline-text-4" id="text-9-1-2">
<pre class="example">
git tag | xargs git tag --delete
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: lin chuan</p>
<p class="date">Created: 2020-03-05 Thu 10:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
